{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_5", "trainable": true, "dtype": "float32", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_7", "batch_input_shape": [null, 60, 255]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": "float32", "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "dtype": "float32", "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "dtype": "float32", "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "dtype": "float32", "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"name": "forward_lstm_5", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "build_config": {"input_shape": [null, 15, 128]}}, "backward_layer": {"class_name": "LSTM", "config": {"name": "backward_lstm_5", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "build_config": {"input_shape": [null, 15, 128]}}}}, {"class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "dtype": "float32", "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0, "l2": 0.01}}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "dtype": "float32", "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 20, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 60, 255]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0005000000237487257, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [3, 255, 64], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_3/kernel", "shape": [3, 64, 128], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_18/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_18/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [64, 20], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [20], "dtype": "float32"}]}]}